<a href="https://colab.research.google.com/github/zlopezr/zlopezr/blob/main/2_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
pd.__version__

'1.2.2'

In [ ]:
dict_data={'CO':[100,200,300], 'MX':[300,400,500], 'CH':[100,800,400]}
dict_data

{'CH': [100, 800, 400], 'CO': [100, 200, 300], 'MX': [300, 400, 500]}

In [ ]:
pd.Series(dict_data)

CO    200
MX    300
CH    400
dtype: int64

In [ ]:
df=pd.DataFrame(dict_data)
df

    CO   MX   CH
0  100  300  100
1  200  400  800
2  300  500  400

In [ ]:
import numpy as np
dict_data={
    'edad':[1,2,3,4,5,6,7,8,9],
    'cm':[115,111,100,155,120,130,120],
    'País':['CO','MX','CO','MX','MX','CH','CH'],
    'Genero':['F','M','F','M','F','M','F'],
    'Q1':[23,45,64,32,22,11,33,55],
    'Q2':[32,45,56,7,8,89,9,2,1]
    }

In [ ]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}

In [ ]:
df=pd.DataFrame(dict_data, index=['Anna','Camilo','Andrea','Zaida','David','Jhon','Alvaro'])
df

        edad   cm pais genero    Q1  Q2
Anna      10  115   co      M   5.0   7
Camilo     9  110   mx      F  10.0   9
Andrea    13  130   co      F   8.0   9
Zaida     14  155   mx      M   NaN   8
David     12  125   mx      M   7.0   8
Jhon      11  120   ch      M   8.0   8
Alvaro    12  125   ch      F   3.0   9

In [ ]:
df.index

Index(['Anna', 'Camilo', 'Andrea', 'Zaida', 'David', 'Jhon', 'Alvaro'], dtype='object')

In [ ]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [ ]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [ ]:
df['edad']

Anna      10
Camilo     9
Andrea    13
Zaida     14
David     12
Jhon      11
Alvaro    12
Name: edad, dtype: int64

In [ ]:
df[['edad','cm','Q1']]

        edad   cm    Q1
Anna      10  115   5.0
Camilo     9  110  10.0
Andrea    13  130   8.0
Zaida     14  155   NaN
David     12  125   7.0
Jhon      11  120   8.0
Alvaro    12  125   3.0

In [ ]:
#Seleccionar datos loc
df.loc[['Zaida','Anna'],['edad','cm','Q1']]

       edad   cm   Q1
Zaida    14  155  NaN
Anna     10  115  5.0

In [ ]:
df.loc['Zaida','Q1']

nan

In [ ]:
df

        edad   cm pais genero    Q1  Q2
Anna      10  115   co      M   5.0   7
Camilo     9  110   mx      F  10.0   9
Andrea    13  130   co      F   8.0   9
Zaida     14  155   mx      M   NaN   8
David     12  125   mx      M   7.0   8
Jhon      11  120   ch      M   8.0   8
Alvaro    12  125   ch      F   3.0   9

In [ ]:
#Seleccionar datos por posición iloc
df.iloc[[4,5],[1,3]]

        cm genero
David  125      M
Jhon   120      M

In [ ]:
#Seleccionar datos por posición iloc
df.iloc[:,[1,3]]

         cm genero
Anna    115      M
Camilo  110      F
Andrea  130      F
Zaida   155      M
David   125      M
Jhon    120      M
Alvaro  125      F

In [ ]:
df

        edad   cm pais genero    Q1  Q2
Anna      10  115   co      M   5.0   7
Camilo     9  110   mx      F  10.0   9
Andrea    13  130   co      F   8.0   9
Zaida     14  155   mx      M   NaN   8
David     12  125   mx      M   7.0   8
Jhon      11  120   ch      M   8.0   8
Alvaro    12  125   ch      F   3.0   9

In [ ]:
df['edad']>=12

Anna      False
Camilo    False
Andrea     True
Zaida      True
David      True
Jhon      False
Alvaro     True
Name: edad, dtype: bool

In [ ]:
#Filtro 
df[(df['edad']>=12) & (df['pais']=='mx')]

       edad   cm pais genero   Q1  Q2
Zaida    14  155   mx      M  NaN   8
David    12  125   mx      M  7.0   8

In [ ]:
df.query('edad>=12')

        edad   cm pais genero   Q1  Q2
Andrea    13  130   co      F  8.0   9
Zaida     14  155   mx      M  NaN   8
David     12  125   mx      M  7.0   8
Alvaro    12  125   ch      F  3.0   9

In [ ]:
df['Q1']>=df['Q2']

Anna      False
Camilo     True
Andrea    False
Zaida     False
David     False
Jhon       True
Alvaro    False
dtype: bool

In [ ]:
df[df['Q2']>=df['Q1']]

        edad   cm pais genero   Q1  Q2
Anna      10  115   co      M  5.0   7
Andrea    13  130   co      F  8.0   9
David     12  125   mx      M  7.0   8
Jhon      11  120   ch      M  8.0   8
Alvaro    12  125   ch      F  3.0   9